IDENTIFICATION				DIVISION.
PROGRAM-ID.				VIRAL.
ENVIRONMENT				DIVISION.
CONFIGURATION				SECTION.
REPOSITORY.
FUNCTION FIB.
DATA					DIVISION.
	WORKING-STORAGE			SECTION.
		01 N			PIC 9(18).
		01 ANS			PIC Z(18).
PROCEDURE				DIVISION.
	MAIN				SECTION.
		ACCEPT N FROM CONSOLE
		MOVE FUNCTION FIB(N) TO ANS
		DISPLAY FUNCTION TRIM(ANS)
	STOP RUN.
END PROGRAM				VIRAL.

IDENTIFICATION				DIVISION.
FUNCTION-ID.				FIB.
ENVIRONMENT				DIVISION.
CONFIGURATION				SECTION.
REPOSITORY.
FUNCTION FUNC.
DATA					DIVISION.
	LOCAL-STORAGE			SECTION.
		01 TEMPORARY-VALUE.
			02 TEMP1	PIC 9(18).
			02 TEMP2	PIC 9(18).
	LINKAGE				SECTION.
		01 NUM			PIC 9(18).
		01 RET			PIC 9(18).
PROCEDURE				DIVISION
	USING BY VALUE NUM,
	RETURNING RET.
		IF NUM < 2 THEN
			COMPUTE RET = NUM,
		ELSE
			COMPUTE TEMP1 = NUM - 2,
			COMPUTE TEMP2 = NUM - 1,
			COMPUTE RET = FUNCTION FIB(TEMP1) + FUNCTION FIB(TEMP2),
		END-IF.
	EXIT FUNCTION.
END FUNCTION				FIB.
